PPT/Thesis_lines.org
#+TAGS: { USE(u) HIDE(h) }
* タイトル
	+ 植田です、よろしくお願いします。
* 目次																																 :5sec:
	+ この発表ではこの流れで説明していきたいと思います。
* 研究目的
	+ 本研究の目的は、抗原抗体反応を表す電子タグを持つエージェントベースド
		エピデミックモデルを作り、感染症の流行現象を解明することです。
* 研究の意義
	+ 通常の数理疫学モデルではケルマックマッケンドリックのような微分方程式
		によって表現されますが、このようなモデルには免疫機構の詳細は組み込まれていません。
	+ 本研究ではエージェントに電子タグを持たせる事により、抗原抗体反応をはじめとする
		免疫機構の詳細をモデルに組み込む事ができます。
* 先行研究紹介
	+ 先行研究紹介をします。
	+ 免疫機構を表す電子タグを持つABEMの研究では、
		これら３つの研究が有名です。
* 数理伝染病学とは何か																								 :HIDE:
	+ 数理伝染病学とは、伝染病の流行を数理モデルを用いて解析する応用数学の
		一分野であり、個人ではなく集団を対象とした学問です。
	+ モデリングに用いられる道具としては、主に、微分方程式、確率か定論、ABMが挙げられます。
	+ 本研究では、ABMを道具として採用しています。
* Agent Based Epidemic Model
	+ Agent Based Epidemic Model とは、先ほど露口君の説明にもありました通常のABMに
		感染などのプロセスを取り入れる事により、数理伝染病学に応用したものです。
	+ 通常のエピデミックモデルに使用される微分方程式モデルに比べて、個体レベルで起きる抗原抗体反応や
		免疫の喪失現象を細かく観察することができます。
	+ ただし、Stochastic Modelであるため、シミュレーションを行うたびに結果が
		変化してしまい、定性的な結果を得る事が難しいことが短所として挙げられます。
* アルゴリズム																												 :HIDE:
	+ アルゴリズムの説明をします。
	+ まず、エージェントの集団に決められた割合でウイルスを感染させます。
	+ そのあと、移動、感染、抗原との接触、免疫獲得のプロセスを繰り返し行います。
	+ これら移動から免疫獲得までのプロセスを１日と定義します。
	+ 自分が感染者である場合、近隣のエージェントに対して自分が持つウイルスの
		中から一つをランダムで選び出し感染させます。
	+ 感染が終わると、自分が持つウイルスに対する免疫を徐々に獲得していきます。
	+ エージェント全員に対して、このアルゴリズムを平等に繰り返して行います。
	+ そしてこの抗原との接触から免疫獲得までのプロセスが抗原抗体反応を表しています。
* 抗原抗体反応
	+ 抗原とは細菌やウイルスのことで、注射などで体内に入るタンパク質なども含まれます。
	+ そして抗体は主に、血液中や体液中に存在し、抗原を認識して結合します。
* 抗原・抗体の電子タグ
	+ DNAは細菌やウイルスにも含まれるので、DNAを構成する塩基配列を、１と０のみで
		構成された配列に見立てることにより、これを電子タグとします。
	+ この考え方に基づくと、すべての遺伝子配列は電子タグによって表現することができます。
* 電子タグの役割
	+ 電子タグとは、１と０のみの配列で、エージェントとウイルスは、同じように電子タグを持っています。
	+ この時、必ずエージェントの方がウイルスよりも配列が長くなっています。
	+ エージェントには２つの状態があり、
	+ ひとつは、右上のようにウイルスのタグを完全に含んでいる時で、そのウイルスに対する
		免疫を獲得している状態を表します。
	+ もうひとつは、それ以外の時で、この場合ウイルスに対する免疫を所持しておりません。
	+ この例の場合、このウイルスに感染する可能性があるのは下のエージェントになります。
	+ 次に、このようなエージェントにウイルスがどのように感染するかの説明をします。
* 11010 vs 011
	+ 簡単な例として、エージェントの電子タグが11010、ウイルスの電子タグが011の場合を説明します。
	+ このエージェントはウイルスのタグを完全には含まないので、まだ免疫を獲得していません。
	+ まずウイルスはエージェントに感染する事が決まると、自分が取り付く位置を決めます。
	+ エージェントの配列の左端から順に、自分の配列と比べていき、自分の配列とどれだけ違うかを
		走査していきます。
	+ この例では図のように、左端では２個、真ん中でも２個、右端では１個、数が違う事になります。
	+ この数字が違う個数の事をハミング距離というのですが、ウイルスは常に最小ハミング距離に
		取り付きます。この場合は最小ハミング距離が１になる、右端に取り付く事により、感染が完了します。
	+ 次にエージェントから見ると、ウイルスが自分の配列の右端に取り付く事により、１つだけ、
		数字を変えると、免疫を獲得できることになります。
	+ なので、エージェントは自分の右端の０を１日かけて１に変えることにより、ウイルスに対する
		免疫を獲得し、それと同時に感染者ではなくなります。
	+ この数字を変える操作をタグフリップといいます。
	+ ではこのモデルを使用して行った数値実験の説明に移ります。

* 実際の免疫機構と電子タグによる表現																	 :HIDE:
	+ 実際の免疫機構との違いを比べてみます。
	+ 初め、健康な人が感染する事により、感染者になります。
	+ 感染者は数日かけて免疫を獲得することにより、健康体に戻ります。
	+ これを電子タグで表現すると、初めエージェントはウイルスを保持していませんが、
		感染する事により、感染者となります。
	+ そして、先ほど述べたようにタグフリップを繰り返すことにより、免疫を獲得し、
		免疫を獲得したと同時に健康体に戻ります。

	+ このモデルを使用して行った数値実験の説明に移ります。
* 数値実験
	+ 初期値は表にあるように設定しました。
	+ 実験を通して、ウイルスは２種類あります。
* 数値実験結果
	+ そして数値実験を行った結果、振動するパターンと、ウイルス同士のタグを上手く重ね合わせる
		事による２つのパターンが観察されました。
* 振動するパターン
	+ まず、振動するパターンの説明をします。
	+ この計算ではウイルスのタグを０だけの配列と１だけの配列の２種類用意しました。
	+ エージェントの配列の長さは同じですが、配列の並び自体はランダムに設定しています。
* 感染者　全体図
	+ 5000日計算した結果、それぞれのウイルスに対する感染者はグラフのようになりました。
	+ 横軸が期間で、縦軸はエージェントの個体数になっています。
	+ 詳しく見るため、最初と最後の方を拡大して見ていきます。
* 感染者　始まり
	+ これは最初の100日の感染者のグラフです。
	+ 初めは特徴はありません。
* 感染者　終わり
	+ これは最後の100日を拡大したものです。
	+ 各ウイルスに対する感染者のグラフが明らかに振動していることが分かります。
* 免疫獲得者　始まり
	+ 続いてこちらは免疫獲得者のグラフの最初の100日を拡大したものです。
	+ こちらも周期的な現象はありません。
* 免疫獲得者　終わり
	+ そして最後を拡大すると、感染者のグラフと同様に振動している様子が分かります。
* 数値計算結果の分析１
	+ このように振動するパターンでは、各ウイルスに対する感染者、免疫獲得者のグラフがお互いに
	 反周期ずれて振動しました。
* オーバーラップするパターン
	+ 次に、オーバーラップするパターンの説明をします。
	+ 先ほどのパターンのウイルスの片方を、表の赤文字の部分だけ変更し、上手く重ね合わせる事により
		免疫を獲得できるようにしました。
* 感染者
	+ これは感染者のグラフです。
	+ 感染がダイアウトしています。
* 免疫獲得者
	+ こちらは免疫獲得者のグラフです。
* 数値計算結果の分析
	+ ２つのウイルスの電子タグの合わせた長さに比べて、エージェントの電子タグの方が短いですが、
		両方のウイルスに対する免疫を獲得しているエージェントが存在し、増加していきます。
* 結論
	+ ウイルスのタグの長さに比べて免疫機構のタグが短い場合でも、上手く重ね合わせる事で十分な
		抗体を作る事ができました。
	+ 各ウイルスの電子タグの構造によって、感染伝播の振動現象が起きたりダイアウトが起きたりする事が
		分かりました。
* 今後の研究																													 :HIDE:
	+ 本研究は空間一様モデルでしたが、今後の研究では非空間一様モデルでも実験してしていきたいと思います。
	+ 加えて本研究で用いた電子タグにより、抗体の社会的な広がりを表現したいと思います。
* ご清聴ありがとうございました。
	+ ご清聴ありがとうございました。
