PPT/Thesis_lines.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Thesis_lines</title>
<!-- 2014-02-12 水 13:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Thesis_lines</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. タイトル</a></li>
<li><a href="#sec-2">2. 目次&#xa0;&#xa0;&#xa0;<span class="tag"><span class="5sec">5sec</span></span></a></li>
<li><a href="#sec-3">3. 研究目的</a></li>
<li><a href="#sec-4">4. 研究の意義</a></li>
<li><a href="#sec-5">5. 先行研究紹介</a></li>
<li><a href="#sec-6">6. 数理伝染病学とは何か&#xa0;&#xa0;&#xa0;<span class="tag"><span class="HIDE">HIDE</span></span></a></li>
<li><a href="#sec-7">7. Agent Based Epidemic Model</a></li>
<li><a href="#sec-8">8. アルゴリズム&#xa0;&#xa0;&#xa0;<span class="tag"><span class="HIDE">HIDE</span></span></a></li>
<li><a href="#sec-9">9. 抗原抗体反応</a></li>
<li><a href="#sec-10">10. 抗原・抗体の電子タグ</a></li>
<li><a href="#sec-11">11. 電子タグの役割</a></li>
<li><a href="#sec-12">12. 11010 vs 011</a></li>
<li><a href="#sec-13">13. 実際の免疫機構と電子タグによる表現&#xa0;&#xa0;&#xa0;<span class="tag"><span class="HIDE">HIDE</span></span></a></li>
<li><a href="#sec-14">14. 数値実験</a></li>
<li><a href="#sec-15">15. 数値実験結果</a></li>
<li><a href="#sec-16">16. 振動するパターン</a></li>
<li><a href="#sec-17">17. 感染者　全体図</a></li>
<li><a href="#sec-18">18. 感染者　始まり</a></li>
<li><a href="#sec-19">19. 感染者　終わり</a></li>
<li><a href="#sec-20">20. 免疫獲得者　始まり</a></li>
<li><a href="#sec-21">21. 免疫獲得者　終わり</a></li>
<li><a href="#sec-22">22. 数値計算結果の分析１</a></li>
<li><a href="#sec-23">23. オーバーラップするパターン</a></li>
<li><a href="#sec-24">24. 感染者</a></li>
<li><a href="#sec-25">25. 免疫獲得者</a></li>
<li><a href="#sec-26">26. 数値計算結果の分析</a></li>
<li><a href="#sec-27">27. 結論</a></li>
<li><a href="#sec-28">28. 今後の研究&#xa0;&#xa0;&#xa0;<span class="tag"><span class="HIDE">HIDE</span></span></a></li>
<li><a href="#sec-29">29. ご清聴ありがとうございました。</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> タイトル</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>植田です、よろしくお願いします。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 目次&#xa0;&#xa0;&#xa0;<span class="tag"><span class="5sec">5sec</span></span></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>この発表ではこの流れで説明していきたいと思います。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 研究目的</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>本研究の目的は、抗原抗体反応を表す電子タグを持つエージェントベースド
エピデミックモデルを作り、感染症の流行現象を解明することです。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 研究の意義</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>通常の数理疫学モデルではケルマックマッケンドリックのような微分方程式
によって表現されますが、このようなモデルには免疫機構の詳細は組み込まれていません。
</li>
<li>本研究ではエージェントに電子タグを持たせる事により、抗原抗体反応をはじめとする
免疫機構の詳細をモデルに組み込む事ができます。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 先行研究紹介</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>先行研究紹介をします。
</li>
<li>免疫機構を表す電子タグを持つABEMの研究では、
これら３つの研究が有名です。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 数理伝染病学とは何か&#xa0;&#xa0;&#xa0;<span class="tag"><span class="HIDE">HIDE</span></span></h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>数理伝染病学とは、伝染病の流行を数理モデルを用いて解析する応用数学の
一分野であり、個人ではなく集団を対象とした学問です。
</li>
<li>モデリングに用いられる道具としては、主に、微分方程式、確率か定論、ABMが挙げられます。
</li>
<li>本研究では、ABMを道具として採用しています。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Agent Based Epidemic Model</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Agent Based Epidemic Model とは、先ほど露口君の説明にもありました通常のABMに
感染などのプロセスを取り入れる事により、数理伝染病学に応用したものです。
</li>
<li>通常のエピデミックモデルに使用される微分方程式モデルに比べて、個体レベルで起きる抗原抗体反応や
免疫の喪失現象を細かく観察することができます。
</li>
<li>ただし、Stochastic Modelであるため、シミュレーションを行うたびに結果が
変化してしまい、定性的な結果を得る事が難しいことが短所として挙げられます。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> アルゴリズム&#xa0;&#xa0;&#xa0;<span class="tag"><span class="HIDE">HIDE</span></span></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>アルゴリズムの説明をします。
</li>
<li>まず、エージェントの集団に決められた割合でウイルスを感染させます。
</li>
<li>そのあと、移動、感染、抗原との接触、免疫獲得のプロセスを繰り返し行います。
</li>
<li>これら移動から免疫獲得までのプロセスを１日と定義します。
</li>
<li>自分が感染者である場合、近隣のエージェントに対して自分が持つウイルスの
中から一つをランダムで選び出し感染させます。
</li>
<li>感染が終わると、自分が持つウイルスに対する免疫を徐々に獲得していきます。
</li>
<li>エージェント全員に対して、このアルゴリズムを平等に繰り返して行います。
</li>
<li>そしてこの抗原との接触から免疫獲得までのプロセスが抗原抗体反応を表しています。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 抗原抗体反応</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>抗原とは細菌やウイルスのことで、注射などで体内に入るタンパク質なども含まれます。
</li>
<li>そして抗体は主に、血液中や体液中に存在し、抗原を認識して結合します。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 抗原・抗体の電子タグ</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>DNAは細菌やウイルスにも含まれるので、DNAを構成する塩基配列を、１と０のみで
構成された配列に見立てることにより、これを電子タグとします。
</li>
<li>この考え方に基づくと、すべての遺伝子配列は電子タグによって表現することができます。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 電子タグの役割</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>電子タグとは、１と０のみの配列で、エージェントとウイルスは、同じように電子タグを持っています。
</li>
<li>この時、必ずエージェントの方がウイルスよりも配列が長くなっています。
</li>
<li>エージェントには２つの状態があり、
</li>
<li>ひとつは、右上のようにウイルスのタグを完全に含んでいる時で、そのウイルスに対する
免疫を獲得している状態を表します。
</li>
<li>もうひとつは、それ以外の時で、この場合ウイルスに対する免疫を所持しておりません。
</li>
<li>この例の場合、このウイルスに感染する可能性があるのは下のエージェントになります。
</li>
<li>次に、このようなエージェントにウイルスがどのように感染するかの説明をします。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 11010 vs 011</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>簡単な例として、エージェントの電子タグが11010、ウイルスの電子タグが011の場合を説明します。
</li>
<li>このエージェントはウイルスのタグを完全には含まないので、まだ免疫を獲得していません。
</li>
<li>まずウイルスはエージェントに感染する事が決まると、自分が取り付く位置を決めます。
</li>
<li>エージェントの配列の左端から順に、自分の配列と比べていき、自分の配列とどれだけ違うかを
走査していきます。
</li>
<li>この例では図のように、左端では２個、真ん中でも２個、右端では１個、数が違う事になります。
</li>
<li>この数字が違う個数の事をハミング距離というのですが、ウイルスは常に最小ハミング距離に
取り付きます。この場合は最小ハミング距離が１になる、右端に取り付く事により、感染が完了します。
</li>
<li>次にエージェントから見ると、ウイルスが自分の配列の右端に取り付く事により、１つだけ、
数字を変えると、免疫を獲得できることになります。
</li>
<li>なので、エージェントは自分の右端の０を１日かけて１に変えることにより、ウイルスに対する
免疫を獲得し、それと同時に感染者ではなくなります。
</li>
<li>この数字を変える操作をタグフリップといいます。
</li>
<li>ではこのモデルを使用して行った数値実験の説明に移ります。
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> 実際の免疫機構と電子タグによる表現&#xa0;&#xa0;&#xa0;<span class="tag"><span class="HIDE">HIDE</span></span></h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>実際の免疫機構との違いを比べてみます。
</li>
<li>初め、健康な人が感染する事により、感染者になります。
</li>
<li>感染者は数日かけて免疫を獲得することにより、健康体に戻ります。
</li>
<li>これを電子タグで表現すると、初めエージェントはウイルスを保持していませんが、
感染する事により、感染者となります。
</li>
<li>そして、先ほど述べたようにタグフリップを繰り返すことにより、免疫を獲得し、
免疫を獲得したと同時に健康体に戻ります。
</li>

<li>このモデルを使用して行った数値実験の説明に移ります。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> 数値実験</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>初期値は表にあるように設定しました。
</li>
<li>実験を通して、ウイルスは２種類あります。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> 数値実験結果</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>そして数値実験を行った結果、振動するパターンと、ウイルス同士のタグを上手く重ね合わせる
事による２つのパターンが観察されました。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> 振動するパターン</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li>まず、振動するパターンの説明をします。
</li>
<li>この計算ではウイルスのタグを０だけの配列と１だけの配列の２種類用意しました。
</li>
<li>エージェントの配列の長さは同じですが、配列の並び自体はランダムに設定しています。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> 感染者　全体図</h2>
<div class="outline-text-2" id="text-17">
<ul class="org-ul">
<li>5000日計算した結果、それぞれのウイルスに対する感染者はグラフのようになりました。
</li>
<li>横軸が期間で、縦軸はエージェントの個体数になっています。
</li>
<li>詳しく見るため、最初と最後の方を拡大して見ていきます。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> 感染者　始まり</h2>
<div class="outline-text-2" id="text-18">
<ul class="org-ul">
<li>これは最初の100日の感染者のグラフです。
</li>
<li>初めは特徴はありません。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> 感染者　終わり</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li>これは最後の100日を拡大したものです。
</li>
<li>各ウイルスに対する感染者のグラフが明らかに振動していることが分かります。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> 免疫獲得者　始まり</h2>
<div class="outline-text-2" id="text-20">
<ul class="org-ul">
<li>続いてこちらは免疫獲得者のグラフの最初の100日を拡大したものです。
</li>
<li>こちらも周期的な現象はありません。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> 免疫獲得者　終わり</h2>
<div class="outline-text-2" id="text-21">
<ul class="org-ul">
<li>そして最後を拡大すると、感染者のグラフと同様に振動している様子が分かります。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> 数値計算結果の分析１</h2>
<div class="outline-text-2" id="text-22">
<ul class="org-ul">
<li>このように振動するパターンでは、各ウイルスに対する感染者、免疫獲得者のグラフがお互いに
反周期ずれて振動しました。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> オーバーラップするパターン</h2>
<div class="outline-text-2" id="text-23">
<ul class="org-ul">
<li>次に、オーバーラップするパターンの説明をします。
</li>
<li>先ほどのパターンのウイルスの片方を、表の赤文字の部分だけ変更し、上手く重ね合わせる事により
免疫を獲得できるようにしました。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> 感染者</h2>
<div class="outline-text-2" id="text-24">
<ul class="org-ul">
<li>これは感染者のグラフです。
</li>
<li>感染がダイアウトしています。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> 免疫獲得者</h2>
<div class="outline-text-2" id="text-25">
<ul class="org-ul">
<li>こちらは免疫獲得者のグラフです。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> 数値計算結果の分析</h2>
<div class="outline-text-2" id="text-26">
<ul class="org-ul">
<li>２つのウイルスの電子タグの合わせた長さに比べて、エージェントの電子タグの方が短いですが、
両方のウイルスに対する免疫を獲得しているエージェントが存在し、増加していきます。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> 結論</h2>
<div class="outline-text-2" id="text-27">
<ul class="org-ul">
<li>ウイルスのタグの長さに比べて免疫機構のタグが短い場合でも、上手く重ね合わせる事で十分な
抗体を作る事ができました。
</li>
<li>各ウイルスの電子タグの構造によって、感染伝播の振動現象が起きたりダイアウトが起きたりする事が
分かりました。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> 今後の研究&#xa0;&#xa0;&#xa0;<span class="tag"><span class="HIDE">HIDE</span></span></h2>
<div class="outline-text-2" id="text-28">
<ul class="org-ul">
<li>本研究は空間一様モデルでしたが、今後の研究では非空間一様モデルでも実験してしていきたいと思います。
</li>
<li>加えて本研究で用いた電子タグにより、抗体の社会的な広がりを表現したいと思います。
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> ご清聴ありがとうございました。</h2>
<div class="outline-text-2" id="text-29">
<ul class="org-ul">
<li>ご清聴ありがとうございました。
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2014-02-12 水 13:50</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
